{
  "about": {
    "title": "About me",
    "description": "Hello! I'm Devaeterne, an experienced Full Stack Developer with expertise in Next.js, React, .NET Core, MVC, MSSQL, and API development. I provide scalable, high-performance solutions with seamless integration of front-end and back-end technologies. With extensive experience in building e-commerce platforms, corporate websites, mobile-friendly applications, and custom software solutions, I can handle a wide range of projects. Additionally, I’m skilled in CMS platforms such as WordPress, OpenCart, Shopify, and Wix, ensuring efficient management of various types of projects. I use the best technologies to create secure, fast, and user-friendly digital experiences, both on the server side and the client side. I’m here to deliver tailored solutions and represent your business in the digital world in the best possible way.",
    "info": [
      {
        "fieldName": "Name",
        "fieldValue": "Devaeterne"
      },
      {
        "fieldName": "Phone",
        "fieldValue": "(+90) 541 734 97 66"
      },
      {
        "fieldName": "Experience",
        "fieldValue": "7+ Years"
      },
      {
        "fieldName": "Freelance",
        "fieldValue": "Available"
      },
      {
        "fieldName": "Languages",
        "fieldValue": "English, Turkish"
      },
      {
        "fieldName": "Email",
        "fieldValue": "info@safaksariyildiz.com"
      }
    ]
  },
  "experience": {
    "icon": "/assets/resume/badge.svg",
    "title": "My Experience",
    "description": "Hello! I`m Devaeterne, a Full Stack Developer with 8 years of experience in the software development industry. Since starting my career, I've gained extensive knowledge and hands-on experience, contributing to numerous successful projects. For the past 7 years, I’ve been working as a Full Stack Developer at a company, where I’ve combined front-end and back-end technologies to deliver scalable, user-friendly solutions. I have worked extensively with modern technologies such as React, Next.js, .NET Core, and MVC, completing a wide range of projects. Additionally, I specialize in MSSQL database management and API development. With my experience in CMS platforms like WordPress, Shopify, OpenCart, and Wix, I offer comprehensive solutions to my clients. My technical expertise and project management skills make me a reliable partner for any software project. I’m here to create innovative and efficient digital experiences.",
    "items": [
      {
        "company": "Citycoco E-Bike",
        "position": "Full Stack Developer",
        "duration": "2023 - 2024"
      },
      {
        "company": "KNB Lojistik",
        "position": "Full Stack Developer",
        "duration": "2018 - 2023"
      },
      {
        "company": "Atom Bilgisayar",
        "position": "Full Stack Developer",
        "duration": "2016 - 2018"
      }
    ]
  },
  "education": {
    "icon": "/assets/resume/cap.svg",
    "title": "My Education",
    "description": "I have strengthened my expertise in software and technology through various certifications. I hold certifications in Data Science, React and Next.js Development, API Development, .NET Core, and MSSQL. These certifications have provided me with in-depth knowledge of current technologies, enabling me to translate theoretical knowledge into practical, industry-relevant solutions. My passion for continuous learning and growth has helped me become more proficient in the tech field.",
    "items": [
      {
        "institution": "DataCamp",
        "position": "Data Scientist",
        "duration": "2024"
      },
      {
        "institution": "Online Course",
        "position": "Full Stack Web Development Bootcamp",
        "duration": "2023"
      },
      {
        "institution": "Online Course",
        "position": "Frontend ReactJs Development",
        "duration": "2022"
      }
    ]
  },
  "skills": {
    "title": "My Skills",
    "description": "I’m proficient in both front-end and back-end development. I have experience in server management and security, as well as working with Docker, Plesk, and cPanel. I’m also skilled in using CMS platforms like WordPress, Shopify, and Wix.",
    "skillList": [
      {
        "icon": "FaHtml5",
        "name": "html 5"
      },
      {
        "icon": "FaCss3",
        "name": "CSS 3"
      },
      {
        "icon": "FaJs",
        "name": "Javascript"
      },
      {
        "icon": "FaFigma",
        "name": "Figma"
      },
      {
        "icon": "FaNodeJs",
        "name": "next.js"
      },
      {
        "icon": "FaReact",
        "name": "React.js"
      },
      {
        "icon": "SiTailwindcss",
        "name": "tailwind.css"
      },
      {
        "icon": "SiNextdotjs",
        "name": "node.js"
      }
    ]
  },
  "projects" : [
    {
      "num" : "01",
      "category" : "Web Development",
      "title" : "Citycoco",
      "description" : "Developed a web application for the electric bike brand Citycoco using MSSQL, .NET Core, and MVC. The platform offers a seamless experience for customers to explore and purchase electric bikes, with efficient data management and user-friendly design.",
      
      "stack" : [
        {
          "name" : "Asp .Net Core"
        },
        {
          "name" : "HTML"
        },
        {
          "name" : "MSSQL"
        },
        {
          "name" : "API Technologies"
        },
        {
          "name" : "Boostrap"
        }
      ],
      "image" : "/assets/work/citycoco.png",
      "live" : "asd",
      "github" : ""
    },
    {
      "num" : "02",
      "category" : "frontend",
      "title" : "project",
      "description" : " desc ",
      "stack" : [
        {
          "name" : "Html5"
        },
        {
          "name" : "CSS3"
        },
        {
          "name" : "NextJs"
        },
        {
          "name" : "ReactJs"
        },
        {
          "name" : "Tailwind"
        }
      ],
      "image" : "/assets/work/thumb1.png",
      "live" : "asd",
      "github" : "asd"
    },
    {
      "num" : "03",
      "category" : "frontend",
      "title" : "project",
      "description" : " desc ",
      "stack" : [
        {
          "name" : "Html5"
        },
        {
          "name" : "CSS3"
        },
        {
          "name" : "NextJs"
        },
        {
          "name" : "ReactJs"
        },
        {
          "name" : "Tailwind"
        }
      ],
      "image" : "/assets/work/thumb1.png",
      "live" : "asd",
      "github" : "asd"
    },
    {
      "num" : "04",
      "category" : "frontend",
      "title" : "project",
      "description" : " desc ",
      "stack" : [
        {
          "name" : "Html5"
        },
        {
          "name" : "CSS3"
        },
        {
          "name" : "NextJs"
        },
        {
          "name" : "ReactJs"
        },
        {
          "name" : "Tailwind"
        }
      ],
      "image" : "/assets/work/thumb1.png",
      "live" : "asd",
      "github" : "asd"
    },
    {
      "num" : "05",
      "category" : "frontend",
      "title" : "project",
      "description" : " desc ",
      "stack" : [
        {
          "name" : "Html5"
        },
        {
          "name" : "CSS3"
        },
        {
          "name" : "NextJs"
        },
        {
          "name" : "ReactJs"
        },
        {
          "name" : "Tailwind"
        }
      ],
      "image" : "/assets/work/thumb3.png",
      "live" : "asd",
      "github" : "asd"
    },
    {
      "num" : "06",
      "category" : "frontend",
      "title" : "project",
      "description" : " desc ",
      "stack" : [
        {
          "name" : "Html5"
        },
        {
          "name" : "CSS3"
        },
        {
          "name" : "NextJs"
        },
        {
          "name" : "ReactJs"
        },
        {
          "name" : "Tailwind"
        }
      ],
      "image" : "/assets/work/thumb2.png",
      "live" : "asd",
      "github" : "asd"
    }
  ],
  
  "services": [
    {
      "id": 1,
      "num": "01",
      "title": "Web Development",
      "description": "I'm a professional web developer specializing in React, Next.js, .NET Core, and MVC. I create modern, user-friendly, and SEO-optimized web applications, including e-commerce platforms and corporate websites. My focus is on fast performance, scalability, and responsive design. Let me help you build a digital presence tailored to your needs!",
      "href": ""
    },
    {
      "id": 2,
      "num": "02",
      "title": "Data Mining",
      "description": "I offering professional data mining services using Python. I specialize in analyzing complex datasets to extract insights and support strategic decisions. Using tools like Pandas, NumPy, and Scikit-learn, I handle data cleaning, processing, modeling, and visualization to deliver tailored, data-driven solutions. Let’s unlock the power of your data!",
      "href": ""
    },
    {
      "id": 3,
      "num": "03",
      "title": "IT Consulting",
      "description": "I provide IT consulting with expertise in Windows and Linux servers. I’m highly skilled in Plesk and cPanel management, ensuring seamless server operations. Additionally, I offer hosting and domain services to meet your business needs. Let me assist you with reliable solutions to optimize your IT infrastructure and online presence!",
      "href": ""
    },
    {
      "id": 4,
      "num": "04",
      "title": "CMS-based Development",
      "description": "I specialize in creating and customizing websites using WordPress, OpenCart, Shopify, and Wix. Whether you need an e-commerce store, a corporate website, or a personal blog, I can deliver solutions tailored to your needs. From design to functionality, I ensure your site is modern, responsive, and fully optimized. Let’s bring your vision to life!",
      "href": ""
    }
  ],
  "messages": []
}
